###############################################################################
# Created by write_sdc
# Fri Aug  1 17:29:03 2025
###############################################################################
current_design FIFO_Model
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name Clk -period 10.0000 [get_ports {Clk}]
set_clock_transition 0.1500 [get_clocks {Clk}]
set_clock_uncertainty 0.2500 Clk
set_propagated_clock [get_clocks {Clk}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[0]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[10]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[11]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[12]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[13]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[14]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[15]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[16]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[17]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[18]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[19]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[1]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[20]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[21]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[22]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[23]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[24]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[25]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[26]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[27]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[28]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[29]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[2]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[30]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[31]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[3]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[4]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[5]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[6]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[7]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[8]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {Data_In[9]}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {FClrN}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {FInN}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {FOutN}]
set_input_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {RstN}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[0]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[10]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[11]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[12]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[13]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[14]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[15]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[16]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[17]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[18]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[19]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[1]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[20]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[21]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[22]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[23]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[24]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[25]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[26]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[27]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[28]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[29]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[2]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[30]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[31]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[3]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[4]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[5]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[6]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[7]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[8]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_Data[9]}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_EmptyN}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_FirstN}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_FullN}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_LastN}]
set_output_delay 2.0000 -clock [get_clocks {Clk}] -add_delay [get_ports {F_SLastN}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {F_EmptyN}]
set_load -pin_load 0.0334 [get_ports {F_FirstN}]
set_load -pin_load 0.0334 [get_ports {F_FullN}]
set_load -pin_load 0.0334 [get_ports {F_LastN}]
set_load -pin_load 0.0334 [get_ports {F_SLastN}]
set_load -pin_load 0.0334 [get_ports {F_Data[31]}]
set_load -pin_load 0.0334 [get_ports {F_Data[30]}]
set_load -pin_load 0.0334 [get_ports {F_Data[29]}]
set_load -pin_load 0.0334 [get_ports {F_Data[28]}]
set_load -pin_load 0.0334 [get_ports {F_Data[27]}]
set_load -pin_load 0.0334 [get_ports {F_Data[26]}]
set_load -pin_load 0.0334 [get_ports {F_Data[25]}]
set_load -pin_load 0.0334 [get_ports {F_Data[24]}]
set_load -pin_load 0.0334 [get_ports {F_Data[23]}]
set_load -pin_load 0.0334 [get_ports {F_Data[22]}]
set_load -pin_load 0.0334 [get_ports {F_Data[21]}]
set_load -pin_load 0.0334 [get_ports {F_Data[20]}]
set_load -pin_load 0.0334 [get_ports {F_Data[19]}]
set_load -pin_load 0.0334 [get_ports {F_Data[18]}]
set_load -pin_load 0.0334 [get_ports {F_Data[17]}]
set_load -pin_load 0.0334 [get_ports {F_Data[16]}]
set_load -pin_load 0.0334 [get_ports {F_Data[15]}]
set_load -pin_load 0.0334 [get_ports {F_Data[14]}]
set_load -pin_load 0.0334 [get_ports {F_Data[13]}]
set_load -pin_load 0.0334 [get_ports {F_Data[12]}]
set_load -pin_load 0.0334 [get_ports {F_Data[11]}]
set_load -pin_load 0.0334 [get_ports {F_Data[10]}]
set_load -pin_load 0.0334 [get_ports {F_Data[9]}]
set_load -pin_load 0.0334 [get_ports {F_Data[8]}]
set_load -pin_load 0.0334 [get_ports {F_Data[7]}]
set_load -pin_load 0.0334 [get_ports {F_Data[6]}]
set_load -pin_load 0.0334 [get_ports {F_Data[5]}]
set_load -pin_load 0.0334 [get_ports {F_Data[4]}]
set_load -pin_load 0.0334 [get_ports {F_Data[3]}]
set_load -pin_load 0.0334 [get_ports {F_Data[2]}]
set_load -pin_load 0.0334 [get_ports {F_Data[1]}]
set_load -pin_load 0.0334 [get_ports {F_Data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FClrN}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FInN}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {FOutN}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {RstN}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Data_In[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 6.0000 [current_design]
